## Pandas Dataframe

In [1]:
import pandas as pd

In [2]:
# Define a dataframe:
client = pd.DataFrame(
    {
        'name': ['Bob', 'Nancy','Amy','Elsa','Jack'],
        'birth_year': [1996, 1997, 1997, 1996, 1997],
        'birth_month': [8, 8, 7, 1, 12],
        'birth_day':[11,23,8,3,11]
    }
)
client

    name  birth_year  birth_month  birth_day
0    Bob        1996            8         11
1  Nancy        1997            8         23
2    Amy        1997            7          8
3   Elsa        1996            1          3
4   Jack        1997           12         11

In [3]:
# Change the order of columns
client = pd.DataFrame(client, columns=['name', 'birth_month', 'birth_day', 'birth_year'])
client

    name  birth_month  birth_day  birth_year
0    Bob            8         11        1996
1  Nancy            8         23        1997
2    Amy            7          8        1997
3   Elsa            1          3        1996
4   Jack           12         11        1997

In [4]:
# Add a new column call lucky_number:
client = pd.DataFrame(client, columns=['name', 'birth_month', 'birth_day', 'lucky_number'])
# Add values 
luckynumber = pd.Series(['3','2','1','7','8'])
client['lucky_number'] = luckynumber
client

    name  birth_month  birth_day lucky_number
0    Bob            8         11            3
1  Nancy            8         23            2
2    Amy            7          8            1
3   Elsa            1          3            7
4   Jack           12         11            8

In [5]:
# Read CSV file by .read_csv()
pokemon = pd.read_csv('./data/pokemon.csv')

In [6]:
# View the information of dataframe
pokemon.info

<bound method DataFrame.info of         Pokemon     Type
0     Bulbasaur    Grass
1       Ivysaur    Grass
2      Venusaur    Grass
3    Charmander     Fire
4    Charmeleon     Fire
..          ...      ...
716     Yveltal     Dark
717     Zygarde   Dragon
718     Diancie     Rock
719       Hoopa  Psychic
720   Volcanion     Fire

[721 rows x 2 columns]>

In [7]:
# Viewing the first n lines
pokemon.head(n=3)

     Pokemon   Type
0  Bulbasaur  Grass
1    Ivysaur  Grass
2   Venusaur  Grass

In [8]:
# Viewing the last n lines
pokemon.tail(n=2)

       Pokemon     Type
719      Hoopa  Psychic
720  Volcanion     Fire

In [9]:
# Viewing the size as (rows,columns)
pokemon.shape

(721, 2)